* im buildng a project portfolio its like an onion it consits of layers;
 # 1. Building a https 1.1 server to learn about networks.
 # 2. Implementing JDK built in server and netty instance.
 # 3. Performing some basic unit and integration tests.
      # 3.5. some performance comparision tests too.

      
#+begin_src java :results output
  public class Main {
      public static void main(String[] args) {
          System.out.print("hello, world");
      }
  }
#+end_src

#+RESULTS:
: hello, world


#+begin_src java :results output
    @FunctionalInterface
    interface Exponenter {
  	  int exponent(int a, int b)
  }
  Exponenter a = (x, y) -> x ** y;
#+end_src

